In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\impre\onedrive\desktop\bootcamp\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.22.4 in c:\users\impre\onedrive\desktop\bootcamp\venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\impre\onedrive\desktop\bootcamp\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\impre\onedrive\desktop\bootcamp\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\impre\onedrive\desktop\bootcamp\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\impre\onedrive\desktop\bootcamp\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

## Pandas

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. It provides two primary data structures: series and dataframe. A Series is one_dimensional array-like object, while DataFrame is two dimensional, size-mutable and potentially heterogeneous tabular data structure with labeled axes(rows and columns)

In [62]:
import pandas as pd

In [63]:
##Series: one dimensional array-like object that can hold any data type. It is similar to column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [64]:
## Series from dictionary elements
data={'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [65]:
data = [10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [66]:
## DataFrame
## Create a dataframe from a dictionary of list

data = {
    'Name' : ['Krish','Prerna','Mayank'],
    'Age' : [25,30,45],
    'City' : ['Banglore','Noida', 'Gurgaon']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0   Krish   25  Banglore
1  Prerna   30     Noida
2  Mayank   45   Gurgaon
<class 'pandas.core.frame.DataFrame'>

In [67]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['Prerna', 30, 'Noida'],
       ['Mayank', 45, 'Gurgaon']], dtype=object)

In [68]:
## Create a data frame fron list of dictionaries
data = [
    {'Name' : 'Krish','Age':32, 'City':'Banglore'},
    {'Name' : 'Kriti','Age':35, 'City':'Noida'},
    {'Name' : 'Krishna','Age':42, 'City':'Mumbai'},
    {'Name' : 'Kripa','Age':52, 'City':'Lucknow'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow
<class 'pandas.core.frame.DataFrame'>

In [69]:
df = pd.read_csv('Sales_Data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [70]:
df = pd.read_csv('Sales_Data.csv')
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [71]:
##Accessing data from data frame
data = [
    {'Name' : 'Krish','Age':32, 'City':'Banglore'},
    {'Name' : 'Kriti','Age':35, 'City':'Noida'},
    {'Name' : 'Krishna','Age':42, 'City':'Mumbai'},
    {'Name' : 'Kripa','Age':52, 'City':'Lucknow'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow
<class 'pandas.core.frame.DataFrame'>

In [72]:
df

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow

In [73]:
df['Name']

0      Krish
1      Kriti
2    Krishna
3      Kripa
Name: Name, dtype: object

In [74]:
df.loc[0]

Name       Krish
Age           32
City    Banglore
Name: 0, dtype: object

In [75]:
df.iloc[0]

Name       Krish
Age           32
City    Banglore
Name: 0, dtype: object

In [76]:
df

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow

In [77]:
##Accessing a specified element
print(df.at[1,'Age'])

35

In [78]:
## Accessing a specified element using list
df.iat[2,2]

'Mumbai'

In [79]:
df

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow

In [80]:
##Data Manipulation with DataFrame
df

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow

In [81]:
#Adding a column
df['Salary']=[50000,60000,70000,90000]
df

      Name  Age      City  Salary
0    Krish   32  Banglore   50000
1    Kriti   35     Noida   60000
2  Krishna   42    Mumbai   70000
3    Kripa   52   Lucknow   90000

In [82]:
#Remove a column
df.drop('Salary',axis=1, inplace=True)

In [83]:
df

      Name  Age      City
0    Krish   32  Banglore
1    Kriti   35     Noida
2  Krishna   42    Mumbai
3    Kripa   52   Lucknow

In [84]:
## Add age to the column
df['Age'] = df['Age']+1
df

      Name  Age      City
0    Krish   33  Banglore
1    Kriti   36     Noida
2  Krishna   43    Mumbai
3    Kripa   53   Lucknow

In [85]:
df.drop(0,inplace=True)

In [86]:
df

      Name  Age     City
1    Kriti   36    Noida
2  Krishna   43   Mumbai
3    Kripa   53  Lucknow

In [87]:
df = pd.read_csv('Sales_Data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [91]:
#Display the data types of each column
print("Data types:\n", df.dtypes)

#Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [93]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000